{
  "project": "Chord Tracker",
  "branchName": "ralph/starting-fret",
  "description": "Starting Fret Number on Fretboard Chart - Allow specifying a starting fret so chords and scale patterns higher up the neck display correctly.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Add starting_fret field to backend Chord model",
      "description": "As a developer, I need to persist a starting fret per chord so it survives page reloads and is available via the API.",
      "acceptanceCriteria": [
        "Add `starting_fret` integer column to `chords` table with default value `0` (0 means from the nut)",
        "Create and run an Alembic migration for the new column",
        "Add `starting_fret` field to `ChordCreate` schema (default 0)",
        "Add `starting_fret` field to `ChordUpdate` schema (optional)",
        "Add `starting_fret` field to `ChordResponse` schema",
        "Existing chords default to `starting_fret = 0` with no data loss",
        "Existing backend tests still pass",
        "Lint passes"
      ],
      "priority": 1,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Add startingFret prop to GuitarNeck component",
      "description": "As a developer, I want the GuitarNeck component to accept a startingFret prop so it renders the correct fret range.",
      "acceptanceCriteria": [
        "Add optional `startingFret` prop (default `0`) to `GuitarNeckProps`",
        "Fret number labels display `startingFret + 1` through `startingFret + fretCount` (e.g., if startingFret=4, labels show 5,6,7,8,9)",
        "When `startingFret > 0`, the thick nut bar is hidden and replaced by a normal fret line",
        "When `startingFret === 0`, the nut bar renders as it does today (thick dark bar)",
        "Marker fret values are absolute — the component subtracts startingFret to determine visual position",
        "Tap targets emit absolute fret numbers (startingFret + relative position)",
        "Markers outside the visible fret window are not rendered but data is preserved",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 2,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "Add starting fret control to chord editor UI",
      "description": "As a user, I want to adjust the starting fret in the chord editor so I can create chords at any neck position.",
      "acceptanceCriteria": [
        "Display the current starting fret value near the fretboard (e.g., 'Starting fret: 5')",
        "Provide increment (+) and decrement (−) buttons to change the starting fret",
        "Minimum starting fret is 0 (nut position); maximum is 19",
        "Changing the starting fret updates the fretboard display immediately",
        "The starting fret value is included when saving a chord (persisted to backend via API)",
        "When editing an existing chord, the starting fret control is pre-populated with the chord's saved starting_fret value",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 3,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-004",
      "title": "Update chord templates with starting fret data",
      "description": "As a user browsing chord templates, I want templates to display at the correct neck position so I can learn proper finger placement.",
      "acceptanceCriteria": [
        "Add `starting_fret` field to `ChordTemplate` interface (default `0`)",
        "Update B and Bm templates to use `starting_fret: 2` with markers adjusted to absolute fret numbers",
        "Templates with `starting_fret: 0` (A, Am, C, D, Dm, E, Em, F, G) remain unchanged",
        "Selecting a template in the browser populates both markers and starting fret in the editor",
        "Template preview renders with the correct starting fret passed to GuitarNeck",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 4,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-005",
      "title": "Display starting fret on chord card previews",
      "description": "As a user viewing my saved chords, I want the mini fretboard previews to reflect the correct starting fret so I can tell chords apart at a glance.",
      "acceptanceCriteria": [
        "Chord card previews pass `startingFret` from the chord's `starting_fret` API field to GuitarNeck",
        "Fret numbers on mini previews reflect the actual fret position on the neck",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 5,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-006",
      "title": "Auto-adjust starting fret when loading chords",
      "description": "As a user, I want the starting fret to auto-adjust when I open a chord whose markers fall outside the default 0-5 range, so I can see all markers immediately.",
      "acceptanceCriteria": [
        "When opening the chord editor for an existing chord, if any markers have fret values above startingFret + fretCount, auto-adjust startingFret so all markers are visible",
        "Auto-adjustment uses the minimum fret among markers minus 1 (or 0 if that would be negative) as the starting fret",
        "If the chord already has a saved starting_fret that shows all markers, use the saved value instead of recalculating",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 6,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-007",
      "title": "Show subtle indicator for out-of-range markers",
      "description": "As a user, I want a visual hint when my chord has markers outside the currently visible fret window so I know there are hidden notes.",
      "acceptanceCriteria": [
        "When a chord has markers below the visible fret range, show a small indicator (e.g., badge or arrow) above the fretboard",
        "When a chord has markers above the visible fret range, show a small indicator below the fretboard",
        "The indicator shows the count of hidden markers (e.g., '2 markers below')",
        "Indicators are shown in both the editor and the card previews",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 7,
      "passes": false,
      "notes": ""
    }
  ]
}
