{
  "project": "Chord Tracker",
  "branchName": "ralph/chord-staff-sequencer",
  "description": "Chord Staff Sequencer - Add a chord sequencing view to the song detail page where users can arrange their song's chords onto a visual music staff with measures, barlines, and repeat annotations.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Create sequence data model and migrations",
      "description": "As a developer, I need database tables to store chord sequences so that sequencing data can be persisted.",
      "acceptanceCriteria": [
        "`sequence` table created with columns: `id`, `song_id` (FK → songs, unique), `time_signature_numerator` (int, default 4), `time_signature_denominator` (int, default 4), `measures_per_line` (int, default 4), `created_at`, `updated_at`",
        "`sequence_measure` table created with columns: `id`, `sequence_id` (FK → sequence), `position` (int, 0-based), `repeat_start` (bool, default false), `repeat_end` (bool, default false), `ending_number` (int, nullable)",
        "`sequence_beat` table created with columns: `id`, `measure_id` (FK → sequence_measure), `beat_position` (int, 1-based), `chord_id` (FK → chords, nullable)",
        "Alembic migration generated and applied successfully",
        "Existing tests still pass",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Backend API for sequence CRUD",
      "description": "As a developer, I need REST endpoints to create, read, and update a song's chord sequence so the frontend can persist changes.",
      "acceptanceCriteria": [
        "`GET /api/songs/{song_id}/sequence` returns full sequence with nested measures and beats; returns 404 if none exists",
        "`POST /api/songs/{song_id}/sequence` creates a new sequence for the song; returns 409 if one already exists",
        "`PUT /api/songs/{song_id}/sequence` replaces the full sequence (measures + beats) with the payload",
        "`DELETE /api/songs/{song_id}/sequence` deletes the sequence and all child records",
        "All endpoints require authentication and verify the song belongs to the authenticated user (403 otherwise)",
        "Pydantic request/response schemas defined for all endpoints",
        "Existing tests still pass",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "Display chord staff on song detail page",
      "description": "As a user, I want to see a music-staff-style display on the song detail page so I can visualize chord sequences like sheet music.",
      "acceptanceCriteria": [
        "A 'Chord Sequence' section appears below the existing chord list on the song detail page",
        "Staff renders multiple lines, each containing 4 measures (measures_per_line)",
        "Each measure is separated by a vertical barline",
        "The time signature (e.g., '4/4') is displayed at the start of the first line",
        "Each measure shows 4 beat slots (matching numerator) for 4/4 time",
        "Empty beat slots display a placeholder (dashed outline)",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 3,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-004",
      "title": "Save and load sequence",
      "description": "As a user, I want my chord sequence to be saved and reloaded when I return to the song so my work is not lost.",
      "acceptanceCriteria": [
        "A 'Save Sequence' button sends the full current sequence state to `PUT /api/songs/{song_id}/sequence`",
        "On page load, the frontend fetches the existing sequence via `GET /api/songs/{song_id}/sequence` and renders it",
        "If no sequence exists yet, the staff initializes with 4 empty measures in 4/4 time",
        "A success toast is shown after a successful save",
        "An error toast is shown if the save fails",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 4,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-005",
      "title": "Drag a chord from the chord list onto a beat slot",
      "description": "As a user, I want to drag a chord from the song's chord list onto the staff so I can build my chord sequence.",
      "acceptanceCriteria": [
        "Each chord in the existing chord list acts as a drag source",
        "Each beat slot in the staff is a drop target",
        "Dropping a chord onto an empty slot places it there and displays the chord name",
        "Dropping a chord onto an occupied slot replaces the existing chord",
        "A chord can be placed on multiple different beat slots",
        "The placement is reflected immediately in the UI without a page reload",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 5,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-006",
      "title": "Remove a chord from a beat slot",
      "description": "As a user, I want to clear a chord from a beat slot so I can correct mistakes or leave a beat empty.",
      "acceptanceCriteria": [
        "Clicking a filled beat slot opens a small popover or context menu with a 'Remove' option",
        "Selecting 'Remove' clears the slot back to the empty placeholder state",
        "Removed chord is reflected in the sequence state immediately",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 6,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-007",
      "title": "Add and remove measures",
      "description": "As a user, I want to add or remove measures on the staff so I can match the length of my song.",
      "acceptanceCriteria": [
        "An 'Add Measure' button appends a new empty measure to the end of the staff",
        "A remove button ('×') on each measure deletes that measure and its beats",
        "Removing a measure with chords shows a confirmation dialog: 'This will remove all chords in this measure'",
        "Measures are repositioned correctly after removal (positions remain 0-based and contiguous)",
        "Staff lines reflow automatically when measure count changes (e.g., 5th measure starts a new line of 4)",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 7,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-008",
      "title": "Configure time signature",
      "description": "As a user, I want to set the time signature for a song's sequence so the correct number of beats per measure is shown.",
      "acceptanceCriteria": [
        "A time signature selector is displayed above the staff (numerator: 2–12; denominator: 2, 4, 8, 16)",
        "Default is 4/4 when creating a new sequence",
        "Changing the time signature updates the beat slot count in every measure immediately",
        "If existing beats exceed the new numerator, those beats are removed after a confirmation dialog warning data will be lost",
        "The updated time signature is persisted on save",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 8,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-009",
      "title": "Add repeat barline annotations",
      "description": "As a user, I want to mark sections of the staff with repeat barlines so I can indicate that a section should be played again.",
      "acceptanceCriteria": [
        "Each measure has a toggle for 'repeat start' and a toggle for 'repeat end'",
        "Toggling repeat start on a measure displays a bold repeat-start barline (`|:`) to the left of that measure",
        "Toggling repeat end on a measure displays a bold repeat-end barline (`:|`) to the right of that measure",
        "Both toggles can be active simultaneously on the same measure",
        "Repeat annotation state is persisted on save",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 9,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-010",
      "title": "Add numbered ending annotations",
      "description": "As a user, I want to mark measures as 1st or 2nd endings so I can write out repeated sections with different endings.",
      "acceptanceCriteria": [
        "Each measure has a selector for ending number: None, 1, or 2",
        "A measure marked as ending 1 displays a bracket labeled '1.' above it",
        "A measure marked as ending 2 displays a bracket labeled '2.' above it",
        "Only one ending number can be active per measure at a time",
        "Ending annotation state is persisted on save",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 10,
      "passes": true,
      "notes": ""
    }
  ]
}
